In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series(data= [-5, 1.3, 21, 6, 3])

0    -5.0
1     1.3
2    21.0
3     6.0
4     3.0
dtype: float64

In [4]:
pd.Series(data= [-5, 1.3, 21, 6, 3],
          index= ['a', 'b', 'c', 'd', 'e'])

a    -5.0
b     1.3
c    21.0
d     6.0
e     3.0
dtype: float64

In [6]:
pd.Series(data= {'a':10, 'b':20, 'c':30})

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data= np.random.randn(3))

0   -0.040134
1   -1.721157
2    0.383613
dtype: float64

Series characteristics

In [10]:
s= pd.Series(data= np.random.randn(5), name='random_series')
s

0   -0.023413
1    1.913944
2   -0.402104
3    0.324784
4   -0.903065
Name: random_series, dtype: float64

In [12]:
s.name
print(s.rename('another_series'))

0   -0.023413
1    1.913944
2   -0.402104
3    0.324784
4   -0.903065
Name: another_series, dtype: float64

In [13]:
s.index

RangeIndex(start=0, stop=5, step=1)

Indexing and Slicing

In [22]:
s= pd.Series(data= range(5),
             index= ['A', 'B', 'C', 'D', 'E'])
s

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [17]:
#s[0]
s.iloc[0]

0

In [19]:
#s[[1, 2, 3]]
s.iloc[[1, 2, 3]]

B    1
C    2
D    3
dtype: int64

In [26]:
s[0:3]

A    0
B    1
C    2
dtype: int64

In [27]:
s[['B', 'D', 'C']]

B    1
D    3
C    2
dtype: int64

In [28]:
s['A': 'C']

A    0
B    1
C    2
dtype: int64

In [29]:
'A' in s

True

In [32]:
2 in s

False

In [33]:
s[s >=s.mean()]

C    2
D    3
E    4
dtype: int64

In [35]:
s != 1

A     True
B    False
C     True
D     True
E     True
dtype: bool

In [36]:
s1= pd.Series(data= range(4),
              index= ['a', 'b', 'c', 'd'])
s1

a    0
b    1
c    2
d    3
dtype: int64

In [37]:
s2= pd.Series(data= range(10, 14),
              index= ['b', 'c', 'd', 'e'])
s2

b    10
c    11
d    12
e    13
dtype: int64

In [38]:
s1+s2

a     NaN
b    11.0
c    13.0
d    15.0
e     NaN
dtype: float64

In [39]:
s1 ** 2

a    0
b    1
c    4
d    9
dtype: int64

In [40]:
np.exp(s1)

a     1.000000
b     2.718282
c     7.389056
d    20.085537
dtype: float64

Chaining operations in pandas

In [46]:
s1.add(3.141).pow(2).mean().astype(int)

22

Data types in pandas

In [47]:
x= pd.Series(['A', 'B'])
x

0    A
1    B
dtype: object

In [48]:
x.map(type)

0    <class 'str'>
1    <class 'str'>
dtype: object

In [51]:
print(f"x memory usage:{x.memory_usage(deep= True)} bytes")

x memory usage:248 bytes

In [53]:
pd.Series([1, 2, 3, np.NaN]).astype('Int64')

0       1
1       2
2       3
3    <NA>
dtype: Int64

Creating DataFrames using pandas

In [2]:
pd.DataFrame([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

Label Index (rows) and columns

In [55]:
pd.DataFrame([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]],
              index= ['R1', 'R2', 'R3'],
              columns= ['C1', 'C2', 'C3'])

    C1  C2  C3
R1   1   2   3
R2   4   5   6
R3   7   8   9

From Dictionary

In [3]:
pd.DataFrame({'Name': ['Mike', 'Tiffany', 'Tom'],
              'Age': [15, 3, 7]})

      Name  Age
0     Mike   15
1  Tiffany    3
2      Tom    7

In [4]:
df= pd.DataFrame({'Name': ['Tom', 'Mike', 'Tiffany'],
                  'Language': ['Python', 'Python', 'R'],
                  'Courses': [5, 4, 7]})
df

      Name Language  Courses
0      Tom   Python        5
1     Mike   Python        4
2  Tiffany        R        7

[] returns a series

In [5]:
df['Name']

0        Tom
1       Mike
2    Tiffany
Name: Name, dtype: object

[[]] returns a dataframe!

In [6]:
df[['Name']]

      Name
0      Tom
1     Mike
2  Tiffany

In [7]:
df[['Name', 'Language']]

      Name Language
0      Tom   Python
1     Mike   Python
2  Tiffany        R

In [8]:
df[1:]

      Name Language  Courses
1     Mike   Python        4
2  Tiffany        R        7

indexing with pandas is generally done with loc[] (for labels) and iloc[] (for integers)

In [9]:
df

      Name Language  Courses
0      Tom   Python        5
1     Mike   Python        4
2  Tiffany        R        7

In [10]:
df.iloc[0] #returns list

Name           Tom
Language    Python
Courses          5
Name: 0, dtype: object

In [11]:
df.iloc[0:2] #returns dataframe

   Name Language  Courses
0   Tom   Python        5
1  Mike   Python        4

In [77]:
df.iloc[2,1] #returns value of index

'R'

In [80]:
df.iloc[[0,1], [1,2]] #returns dataframe

  Language  Courses
0   Python        5
1   Python        4

In [84]:
df.loc[:,'Name'] #returns column as list

0        Tom
1       Mike
2    Tiffany
Name: Name, dtype: object

In [12]:
df.loc[[0,2], ['Language']] #returns both row and column reference as df

  Language
0   Python
2        R

In [13]:
df.index
df.columns
print(df.loc[df.index[0], 'Courses'])
print(df.loc[2, df.columns[1]])

5
R

In [92]:
df

      Name Language  Courses
0      Tom   Python        5
1     Mike   Python        4
2  Tiffany        R        7

Using boolean masks

In [14]:
print(df[df['Courses'] > 5])
print(df[df['Name'] == 'Tom'])

      Name Language  Courses
2  Tiffany        R        7
  Name Language  Courses
0  Tom   Python        5

Using .query() the expression should be in ""

In [18]:
df.query("Courses > 4 & Language == 'Python'")

  Name Language  Courses
0  Tom   Python        5

In [23]:
df[(df['Courses'] > 4) & (df['Language']== 'Python')]

  Name Language  Courses
0  Tom   Python        5

Query reference using variable using @

In [24]:
course_threshold = 4
df.query("Courses >@course_threshold")

      Name Language  Courses
0      Tom   Python        5
2  Tiffany        R        7

In [29]:
df.sort_values(by= 'Courses', ascending= False)

      Name Language  Courses
2  Tiffany        R        7
0      Tom   Python        5
1     Mike   Python        4

In [30]:
df.min()

Name          Mike
Language    Python
Courses          4
dtype: object

In [32]:
df['Courses'].idxmin()

1

In [33]:
df.iloc[2]

Name        Tiffany
Language          R
Courses           7
Name: 2, dtype: object

Exercises on Pandas

1 Import pandas

In [34]:

import pandas as pd

2 Import csv from url

In [35]:
url= 'https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-02-18/food_consumption.csv'
df= pd.read_csv(url)
df

         country             food_category  consumption  co2_emmission
0      Argentina                      Pork        10.51          37.20
1      Argentina                   Poultry        38.66          41.53
2      Argentina                      Beef        55.48        1712.00
3      Argentina               Lamb & Goat         1.56          54.63
4      Argentina                      Fish         4.36           6.96
...          ...                       ...          ...            ...
1425  Bangladesh        Milk - inc. cheese        21.91          31.21
1426  Bangladesh  Wheat and Wheat Products        17.47           3.33
1427  Bangladesh                      Rice       171.73         219.76
1428  Bangladesh                  Soybeans         0.61           0.27
1429  Bangladesh   Nuts inc. Peanut Butter         0.72           1.27

[1430 rows x 4 columns]

3 How many rows and columns are there

In [48]:
df

         country             food_category  consumption  co2_emmission
0      Argentina                      Pork        10.51          37.20
1      Argentina                   Poultry        38.66          41.53
2      Argentina                      Beef        55.48        1712.00
3      Argentina               Lamb & Goat         1.56          54.63
4      Argentina                      Fish         4.36           6.96
...          ...                       ...          ...            ...
1425  Bangladesh        Milk - inc. cheese        21.91          31.21
1426  Bangladesh  Wheat and Wheat Products        17.47           3.33
1427  Bangladesh                      Rice       171.73         219.76
1428  Bangladesh                  Soybeans         0.61           0.27
1429  Bangladesh   Nuts inc. Peanut Butter         0.72           1.27

[1430 rows x 4 columns]

In [129]:
"3.How many rows/columns"
df.shape

(1430, 4)

4 Type of data in each column

In [131]:
#df.dtypes #we dont use () because we arent calling a series
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1430 entries, 0 to 1429
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   country        1430 non-null   object
 1   food_category  1430 non-null   object
 2   consumption    1430 non-null   float64
 3   co2_emmission  1430 non-null   float64
dtypes: float64(2), object(2)
memory usage: 44.8+ KB

5 Mean of co2 emission

In [51]:
df['co2_emmission'].mean()

74.383993006993

6 How many kinds of food are there in the dataset
How many countries are in the dataset

In [135]:
#df['food_category'].value_counts()
print(f"There are {df['food_category'].nunique()} different foods")

There are 11 different foods

In [137]:
print(f"There are {df['country'].nunique()} distinct countries")

There are 130 distinct countries

7 Maximum co2 emission, food type and country it belongs to*****

In [145]:
#df.max()
df.iloc[df['co2_emmission'].idxmax()]

country          Argentina
food_category         Beef
consumption          55.48
co2_emmission       1712.0
Name: 2, dtype: object

8.How many countries produce 1000kg/person/year for at least 1 food type

In [149]:
#emission_threshold= 1000
#df.query('co2_emmission >@emission_threshold')
df.query("co2_emmission > 1000")

       country food_category  consumption  co2_emmission
2    Argentina          Beef        55.48        1712.00
13   Australia          Beef        33.86        1044.85
57         USA          Beef        36.24        1118.29
90      Brazil          Beef        39.25        1211.17
123    Bermuda          Beef        33.15        1022.94

9.Which country consumes the least amount of beef per person per year*******

In [151]:
#df.min()
(df.query("food_category == 'Beef'")
   .sort_values(by= 'consumption')
   .head(1))

      country food_category  consumption  co2_emmission
1410  Liberia          Beef         0.78          24.07

In [87]:
df.query("food_category == 'Beef'").min()

country          Albania
food_category       Beef
consumption         0.78
co2_emmission      24.07
dtype: object

10.Which country consumes the most amount of soybeans per person per year***

In [160]:
#df.query("food_category == 'Soybeans'").max()
(df.query("food_category == 'Soybeans'")
  .sort_values(by= 'consumption', ascending= False)
  .head())

          country food_category  consumption  co2_emmission
1010  Taiwan. ROC      Soybeans        16.95           7.63
757   South Korea      Soybeans         8.35           3.76
933         Japan      Soybeans         7.34           3.30
1219       Zambia      Soybeans         7.30           3.29
977          Cuba      Soybeans         6.34           2.85

In [161]:
df.query("food_category == 'Soybeans'").max()

country          Zimbabwe
food_category    Soybeans
consumption         16.95
co2_emmission        7.63
dtype: object

11.What is the total emission of all the meat products in the dataset combined

In [176]:
meat= ['Pork', 'Poultry', 'Fish', 'Lamb & Goat', 'Beef'] #create a variable meat
(df['co2_emmission']
[df['food_category'].isin(meat)].sum()) #sum the emmissions by meat

# (df.query("food_category == ['Pork', 'Poultry', 'Fish', 'Lamb & Goat', 'Beef']")
#    .sort_values(by= 'co2_emmission')
#    .sum())

74441.13

12.What is the total emmission of all other (non-meat) products in the dataset combined

In [178]:
meat
(df['co2_emmission']
[~df['food_category'].isin (meat)].sum())

31927.98